Revit 2024 API
ScheduleField.FieldIndex Property
 The index of the field in the containing ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int FieldIndex { get; }
Visual Basic
Public ReadOnly Property FieldIndex As Integer
	Get
Visual C++
public:
property int FieldIndex {
	int get ();
}
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace